


                                      Курсовая работа по базам данных.

Требования к курсовому проекту:
#Составить общее текстовое описание БД и решаемых ею задач;
минимальное количество таблиц - 10;
скрипты создания структуры БД (с первичными ключами, индексами, внешними ключами);
создать ERDiagram для БД;
скрипты наполнения БД данными;
скрипты характерных выборок (включающие группировки, JOIN'ы, вложенные таблицы);
представления (минимум 2);
хранимые процедуры / триггеры;
Примеры: описать модель хранения данных популярного веб-сайта: кинопоиск, booking.com, wikipedia, интернет-магазин, госуслуги...

Описание проекта
MovieLand - упорщенная модель хранения данных, таких сервисов как кинопоиск и netflix.

С помощью сервиса filldb.info для демонстрации работы скриптов были сформированы данные.


